app/views/photos/_form.html.erb

<%= f.label :category  %>
<%= select_tag "category_id", options_from_collection_for_select(Category.all, :id,:name) %>
---
SELECT "categories".* FROM "categories"