app/views/photos/index.html.erb


<%= select_tag "category_id", options_from_collection_for_select(Category.all, :id,:name) %>
---
SELECT "categories".* FROM "categories"