app/controllers/images_controller.rb

SELECT "images".* FROM "images"
SELECT SUM("vote_for_photos"."like") FROM "vote_for_photos" WHERE "vote_for_photos"."image_id" = ?  [["image_id", 5]]
---
  def index
    @images = Image.all
    @like = {}
    @images.each do |image|
      @voteforphotos = VoteForPhoto.where(image_id: image.id).sum(:like)

INSERT INTO "images" ("user_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = current_user

    if params[:images]
      params[:images].each {|image|
        @files = @user.images.create(image: image)

DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]
---
  def destroy
    @image.destroy

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "vote_for_photos".* FROM "vote_for_photos" WHERE "vote_for_photos"."user_id" = ? AND "vote_for_photos"."image_id" = ? ORDER BY "vote_for_photos"."id" ASC LIMIT ?  [["user_id", 16], ["image_id", 5], ["LIMIT", 1]]
INSERT INTO "vote_for_photos" ("user_id", "image_id", "like", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 16], ["image_id", 5], ["like", 1], ["created_at", "2017-12-08 16:46:04.642167"], ["updated_at", "2017-12-08 16:46:04.642167"]]
UPDATE "vote_for_photos" SET "like" = ?, "updated_at" = ? WHERE "vote_for_photos"."id" = ?  [["like", 0], ["updated_at", "2017-12-08 16:56:48.682665"], ["id", 2]]
---
  def voteforphoto
    @image = Image.find(params[:id])
    @voteforphoto = VoteForPhoto.where(user_id: current_user.id, image_id: @image.id).first
    if @voteforphoto == nil
       @like = 1
       VoteForPhoto.create(user_id: current_user.id, image_id: @image.id, like: @like)
     elsif @voteforphoto.like == 0
       @voteforphoto.update(like: @voteforphoto.like + 1)