app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
SELECT  "votes".* FROM "votes" WHERE "votes"."photo_id" = ? LIMIT ?  [["photo_id", 15], ["LIMIT", 1]]
SELECT SUM("votes"."like") FROM "votes" WHERE "votes"."photo_id" = ?  [["photo_id", 15]]
---
  def index
    @photos = Photo.all
    @like = {}
    @photos.each do |photo|
      @votes = Vote.where(photo_id: photo.id).sum(:like)

INSERT INTO "photos" ("name", "user_id", "category_id", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["user_id", 9], ["category_id", 1], ["created_at", "2017-11-27 10:41:50.864195"], ["updated_at", "2017-11-27 10:41:50.864195"], ["photo", "photo_2017-11-12_14-47-57.jpg"]]
---
  def create
    params[:photo][:user_id] = current_user.id
    params[:photo][:category_id] = params[:category_id]
    @photo = Photo.create(photo_params)

UPDATE "photos" SET "photo" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["photo", "photo_2017-11-12_14-47-57.jpg"], ["updated_at", "2017-11-30 21:23:13.811736"], ["id", 12]]
---
  def update
    params[:photo][:user_id] = @photo.user_id
    params[:photo][:category_id] = @photo.category_id
    @photo.update(photo_params)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."photo_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 16], ["photo_id", 15], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "photo_id", "like", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 16], ["photo_id", 15], ["like", 1], ["created_at", "2017-12-01 10:57:02.063409"], ["updated_at", "2017-12-01 10:57:02.063409"]]
UPDATE "votes" SET "photo_id" = ?, "like" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["photo_id", 15], ["like", 2], ["updated_at", "2017-12-01 10:57:59.278705"], ["id", 2]]
---
  def vote
    @photo = Photo.find(params[:id])
    @vote = Vote.where(user_id: current_user.id, photo_id: @photo.id).first
    if @vote == nil || @vote.like == 0
       @like = 1
       Vote.create(user_id: current_user.id, photo_id: @photo.id, like: @like)
     else
       @vote.update(like: @vote.like - 1)