app/controllers/posts_controller.rb

  def create
  	@post = current_user.posts.build(post_params)
  	if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "some text"], ["user_id", 1], ["created_at", "2017-10-30 11:17:25.314810"], ["updated_at", "2017-10-30 11:17:25.314810"]]

  def update
  	@post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "First some text"], ["updated_at", "2017-10-30 11:40:28.599808"], ["id", 1]]