app/controllers/postcomments_controller.rb

  def create
  	params[:postcomment][:post_id] = params[:post_id]
  	params[:postcomment][:user_id] = current_user.id
    @comment = Postcomment.create(comment_params)
---
INSERT INTO "postcomments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test comment"], ["post_id", 4], ["user_id", 4], ["created_at", "2017-11-06 11:17:52.843154"], ["updated_at", "2017-11-06 11:17:52.843154"]]